app/controllers/api/v1/employers_controller.rb

    def index
        employers = Employer.all
---
SELECT "employers".* FROM "employers"