app/controllers/api/v1/portfolio_items_controller.rb

SELECT "portfolio_items".* FROM "portfolio_items"
---
    def index
        portfolioItems = PortfolioItem.all

INSERT INTO "portfolio_items" ("title", "blurb", "git_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "title test"], ["blurb", "blurb"], ["git_url", "url"], ["user_id", 2], ["created_at", "2020-01-30 20:19:28.714667"], ["updated_at", "2020-01-30 20:19:28.714667"]]
---
    def create
        portfolioItem = PortfolioItem.create(portfolio_item_params)